# CloseConnectedFaceSet Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..CloseConnectedFaceSet Method
TessellatedShapeBuilder Class See Also
---
Closes the currently open connected face set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public void CloseConnectedFaceSet()
```

Visual Basic
---
```text
Public Sub CloseConnectedFaceSet
```

Visual C++
---
```text
public:
void CloseConnectedFaceSet()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | A face set is empty and cannot be closed until some faces are added. |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace